<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

# `pandas` Data Munging Overview: Part 1

_Authors: Joseph Nelson (DC)_

---

**Warning: This is a resource-heavy notebook that can consume a lot of RAM, especially when it's run in Chrome. For this lesson, you may want to close idle applications and/or open this notebook with Safari.**

### Lesson Guide
- [The Basics of `pandas` DataFrames](#basics)
    - [Loading Data](#loading)
    - [A Basic Examination of DataFrames](#examine)
    - [Selecting Columns](#selecting)
    - [Describing Data](#describing)
- [Exercise #1](#exercise-1)
- [Filtering and Sorting DataFrames](#filtering-sorting)
    - [Boolean Filtering](#filtering)
    - [Sorting](#sorting)
- [Exercise #2](#exercise-2)
- [Renaming, Adding, and Removing Columns](#columns)
    - [Renaming Columns](#renaming-columns)
    - [Adding Columns](#adding-columns)
    - [Removing Columns](#removing-columns)
- [Handling Missing Values](#missing)
    - [Finding Missing Values](#find-missing)
    - [Dropping Missing Values](#drop-missing)
    - [Filling in Missing Values](#fill-missing)

<a id='basics'></a>

## The Basics of `pandas` DataFrames

---

In [1]:
import pandas as pd

<a id='loading'></a>
### Loading Data

**Q.1** You can read in a file either from your local computer or directly from a URL.

```Python
# Local:
users = pd.read_table('../datasets/users.txt')

# Remote:
users = pd.read_table('https://git.generalassemb.ly/dsi-unit-2/pandas-data_munging_full_overview-lesson/tree/master/datasets/users.txt')
```

Read in the data using the method you prefer.

In [2]:
users = pd.read_table('./datasets/users.txt')

**Q.2** Use kwargs to set appropriate data-reading parameters.

In [3]:
users = pd.read_table('./datasets/users.txt', sep='|')
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

<a id='examine'></a>
### A Basic Examination of DataFrames

**Q.1** Print the type of `users`.

In [4]:
print type(users)
print users.info()

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
user_id       943 non-null int64
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zip_code      943 non-null object
dtypes: int64(2), object(3)
memory usage: 36.9+ KB
None

**Q.2** Print the first five rows, first ten rows, and last two rows of `users`.

In [5]:
users.head(5)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [6]:
users.head(10)

   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
1        2   53      F          other    94043
2        3   23      M         writer    32067
3        4   24      M     technician    43537
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344
7        8   36      M  administrator    05201
8        9   29      M        student    01002
9       10   53      M         lawyer    90703

In [7]:
users.tail(2)

     user_id  age gender occupation zip_code
941      942   48      F  librarian    78209
942      943   22      M    student    77841

**Q.3** Print the index and columns.

In [8]:
print users.index
print users.columns

RangeIndex(start=0, stop=943, step=1)
Index([u'user_id', u'age', u'gender', u'occupation', u'zip_code'], dtype='object')

**Q.4** Find the dtypes of the columns.

In [9]:
users.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

**Q.5** Find the dimensions of the DataFrame.

In [10]:
users.shape

(943, 5)

**Q.6** Extract the underlying `numpy` array as a new variable.

In [11]:
# A:

<a id='selecting'></a>
### Selecting Columns

**Q.1** Assign the `gender` column to a variable.

In [12]:
gender = users['gender']

**Q.2** What is the type of `gender`?

In [13]:
gender.dtypes

dtype('O')

**Q.3** Select `gender` and `occupation` as a new DataFrame.

In [14]:
df = users[['gender','occupation']]
df.head()

  gender  occupation
0      M  technician
1      F       other
2      M      writer
3      M  technician
4      F       other

<a id='describing'></a>
### Describing Data

**Q.1** Calculate the descriptive statistics for the numeric columns in the DataFrame (_which is the function default_).

In [15]:
users.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

**Q.2** Describe the "object" (string) columns.

In [16]:
users.describe(include=['O'])

       gender occupation zip_code
count     943        943      943
unique      2         21      795
top         M    student    55414
freq      670        196        9

**Q.3** Describe all of the columns, regardless of type.

In [17]:
users.describe(include='all')

           user_id         age gender occupation zip_code
count   943.000000  943.000000    943        943      943
unique         NaN         NaN      2         21      795
top            NaN         NaN      M    student    55414
freq           NaN         NaN    670        196        9
mean    472.000000   34.051962    NaN        NaN      NaN
std     272.364951   12.192740    NaN        NaN      NaN
min       1.000000    7.000000    NaN        NaN      NaN
25%     236.500000   25.000000    NaN        NaN      NaN
50%     472.000000   31.000000    NaN        NaN      NaN
75%     707.500000   43.000000    NaN        NaN      NaN
max     943.000000   73.000000    NaN        NaN      NaN

**Q.4** Describe the `gender` Series from the `users` DataFrame.

In [18]:
users['gender'].describe()

count     943
unique      2
top         M
freq      670
Name: gender, dtype: object

**Q.5** Calculate the mean of the `age` column.

In [19]:
users['age'].mean()

34.05196182396607

**Q.6** Calculate the counts of distinct values in the `gender` and `age` columns.

In [20]:
users[['gender','age']].nunique()

gender     2
age       61
dtype: int64

<a id='exercise-1'></a>
## Exercise #1

---

Load the `drinks.csv` data provided in the URL below.

**Perform the following:**
1. Print the head and tail.
2. Look at the index, columns, dtypes, and shape.
3. Assign the `beer_servings` column/Series to a variable.
4. Calculate summary statistics for `beer_servings`.
5. Calculate the median of `beer_servings`.
6. Count the values of unique categories in `continent`.
7. Print the dimensions of the `drinks` DataFrame.
8. Find the first three items of the value counts of the `occupation` column.

**BONUS:**
1. Create the `users` DataFrame from the `user_file` provided (which lacks a header row).
2. Supply a header: `['user_id', 'age', 'gender', 'occupation', 'zip_code']`.

In [21]:
#  Use your preferred file location to read in the data:
remote_drinks_csv = 'https://git.generalassemb.ly/dsi-unit-2/pandas-data_munging_full_overview-lesson/tree/master/datasets/drinks.csv'
local_drinks_csv = 'datasets/drinks.csv'
# and
remote_user_file ='https://git.generalassemb.ly/dsi-unit-2/pandas-data_munging_full_overview-lesson/tree/master/datasets/users_original.txt'
local_user_file = 'datasets/users_original.txt'

In [22]:
df = pd.read_csv(local_drinks_csv)
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [23]:
df.tail()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [24]:
print df.index
print df.columns
print df.dtypes
print df.shape

RangeIndex(start=0, stop=193, step=1)
Index([u'country', u'beer_servings', u'spirit_servings', u'wine_servings',
       u'total_litres_of_pure_alcohol', u'continent'],
      dtype='object')
country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object
(193, 6)

In [25]:
beer = df['beer_servings']

In [26]:
beer.describe()

count    193.000000
mean     106.160622
std      101.143103
min        0.000000
25%       20.000000
50%       76.000000
75%      188.000000
max      376.000000
Name: beer_servings, dtype: float64

In [27]:
beer.median()

76.0

In [28]:
df['continent'].nunique()

5

In [29]:
users.groupby('occupation').size().sort_values(ascending=False).head(3)

occupation
student     196
other       105
educator     95
dtype: int64

<a id='filtering-sorting'></a>

## Filtering and Sorting DataFrames

---

<a id='filtering'></a>
### Boolean Filtering

**Q.1** Show users `age < 20` using a Boolean mask.

In [30]:
users.head(3)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067

In [37]:
users[users['age']<20].head(3)

    user_id  age gender occupation zip_code
29       30    7      M    student    55436
35       36   19      F    student    93117
51       52   18      F    student    55105

**Q.2** Calculate the value counts of `occupation` for users `age < 20`.

In [34]:
users[users['age']<20]['occupation'].value_counts()

student          64
other             4
none              3
writer            2
entertainment     2
salesman          1
artist            1
Name: occupation, dtype: int64

**Q.3** Print the male users `age < 20`.

In [41]:
users[(users['age']<20) & (users['gender']=='M')].head(3)

    user_id  age gender occupation zip_code
29       30    7      M    student    55436
56       57   16      M       none    84010
66       67   17      M    student    60402

**Q.4** Print the users `age < 10` or `age > 70`.

In [43]:
users[(users['age']<20) | (users['age']>20)].head(3)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067

<a id='sorting'></a>
### Sorting

**Q.1** Return the `age` column sorted in ascending order.

In [44]:
users['age'].sort_values()

29      7
470    10
288    11
879    13
608    13
141    13
673    13
627    13
812    14
205    14
886    14
848    15
280    15
460    15
617    15
178    15
100    15
56     16
579    16
549    16
450    16
433    16
620    17
618    17
760    17
374    17
903    17
645    17
581    17
256    17
       ..
89     60
307    60
930    60
751    60
468    60
463    60
233    60
693    60
933    61
350    61
105    61
519    62
265    62
857    63
776    63
363    63
844    64
422    64
317    65
650    65
563    65
210    66
348    68
572    68
558    69
584    69
766    70
802    70
859    70
480    73
Name: age, Length: 943, dtype: int64

**Q.2** Sort the `users` DataFrame by the `age` column (ascending).

In [46]:
users.sort_values('age')

     user_id  age gender     occupation zip_code
29        30    7      M        student    55436
470      471   10      M        student    77459
288      289   11      M           none    94619
879      880   13      M        student    83702
608      609   13      F        student    55106
141      142   13      M          other    48118
673      674   13      F        student    55337
627      628   13      M           none    94306
812      813   14      F        student    02136
205      206   14      F        student    53115
886      887   14      F        student    27249
848      849   15      F        student    25652
280      281   15      F        student    06059
460      461   15      M        student    98102
617      618   15      F        student    44212
178      179   15      M  entertainment    20755
100      101   15      M        student    05146
56        57   16      M           none    84010
579      580   16      M        student    17961
549      550   16      F        student    95453
450      451   16      M        student    48446
433      434   16      F        student    49705
620      621   17      M        student    60402
618      619   17      M        student    44134
760      761   17      M        student    97302
374      375   17      M  entertainment    37777
903      904   17      F        student    61073
645      646   17      F        student    51250
581      582   17      M        student    93003
256      257   17      M        student    77005
..       ...  ...    ...            ...      ...
89        90   60      M       educator    78155
307      308   60      M        retired    95076
930      931   60      M       educator    33556
751      752   60      M        retired    21201
468      469   60      M       educator    78628
463      464   60      M         writer    94583
233      234   60      M        retired    94702
693      694   60      M     programmer    06365
933      934   61      M       engineer    22902
350      351   61      M       educator    49938
105      106   61      M        retired    55125
519      520   62      M     healthcare    12603
265      266   62      F  administrator    78756
857      858   63      M       educator    09645
776      777   63      M     programmer    01810
363      364   63      M       engineer    01810
844      845   64      M         doctor    97405
422      423   64      M          other    91606
317      318   65      M        retired    06518
650      651   65      M        retired    02903
563      564   65      M        retired    94591
210      211   66      M       salesman    32605
348      349   68      M        retired    61455
572      573   68      M        retired    48911
558      559   69      M      executive    10022
584      585   69      M      librarian    98501
766      767   70      M       engineer    00000
802      803   70      M  administrator    78212
859      860   70      F        retired    48322
480      481   73      M        retired    37771

[943 rows x 5 columns]

**Q.3** Sort the `users` DataFrame by the `age` column in *descending* order.

In [47]:
users.sort_values('age', ascending=False)

     user_id  age gender     occupation zip_code
480      481   73      M        retired    37771
802      803   70      M  administrator    78212
766      767   70      M       engineer    00000
859      860   70      F        retired    48322
584      585   69      M      librarian    98501
558      559   69      M      executive    10022
348      349   68      M        retired    61455
572      573   68      M        retired    48911
210      211   66      M       salesman    32605
650      651   65      M        retired    02903
563      564   65      M        retired    94591
317      318   65      M        retired    06518
844      845   64      M         doctor    97405
422      423   64      M          other    91606
857      858   63      M       educator    09645
363      364   63      M       engineer    01810
776      777   63      M     programmer    01810
265      266   62      F  administrator    78756
519      520   62      M     healthcare    12603
933      934   61      M       engineer    22902
350      351   61      M       educator    49938
105      106   61      M        retired    55125
463      464   60      M         writer    94583
468      469   60      M       educator    78628
233      234   60      M        retired    94702
899      900   60      M        retired    18505
307      308   60      M        retired    95076
930      931   60      M       educator    33556
693      694   60      M     programmer    06365
751      752   60      M        retired    21201
..       ...  ...    ...            ...      ...
699      700   17      M        student    76309
645      646   17      F        student    51250
862      863   17      M        student    60089
374      375   17      M  entertainment    37777
760      761   17      M        student    97302
620      621   17      M        student    60402
256      257   17      M        student    77005
903      904   17      F        student    61073
433      434   16      F        student    49705
450      451   16      M        student    48446
549      550   16      F        student    95453
56        57   16      M           none    84010
579      580   16      M        student    17961
178      179   15      M  entertainment    20755
460      461   15      M        student    98102
617      618   15      F        student    44212
848      849   15      F        student    25652
280      281   15      F        student    06059
100      101   15      M        student    05146
812      813   14      F        student    02136
886      887   14      F        student    27249
205      206   14      F        student    53115
627      628   13      M           none    94306
673      674   13      F        student    55337
141      142   13      M          other    48118
879      880   13      M        student    83702
608      609   13      F        student    55106
288      289   11      M           none    94619
470      471   10      M        student    77459
29        30    7      M        student    55436

[943 rows x 5 columns]

<a id='exercise-2'></a>

## Exercise #2

---

**Using the `drinks` DataFrame from the previous exercise:**
1. Filter `drinks` to include only European countries.
2. Filter `drinks` to include only European countries with `wine_servings` > 300.
3. Calculate the mean `beer_servings` for all of Europe.
4. Determine which 10 countries have the highest `total_litres_of_pure_alcohol`.

**Using the `users` DataFrame:**
1. Sort `users` by occupation and then by `age` in a single command.
2. Filter `users` to only include doctors and lawyers without using a `|`.

> **Hint:** Look up `pandas.Series.isin`.

In [48]:
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [51]:
df[df['continent']=='EU'].head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
1,Albania,89,132,54,4.9,EU
3,Andorra,245,138,312,12.4,EU
7,Armenia,21,179,11,3.8,EU
9,Austria,279,75,191,9.7,EU
10,Azerbaijan,21,46,5,1.3,EU

In [50]:
df[df['wine_servings']>300]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
3,Andorra,245,138,312,12.4,EU
61,France,127,151,370,11.8,EU
136,Portugal,194,67,339,11.0,EU

In [52]:
df[df['continent']=='EU']['beer_servings'].mean()

193.77777777777777

In [54]:
df.sort_values('total_litres_of_pure_alcohol', ascending=False).head(10)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
15,Belarus,142,373,42,14.4,EU
98,Lithuania,343,244,56,12.9,EU
3,Andorra,245,138,312,12.4,EU
68,Grenada,199,438,28,11.9,NaN
45,Czech Republic,361,170,134,11.8,EU
61,France,127,151,370,11.8,EU
141,Russian Federation,247,326,73,11.5,AS
81,Ireland,313,118,165,11.4,EU
155,Slovakia,196,293,116,11.4,EU
99,Luxembourg,236,133,271,11.4,EU

<a id='columns'></a>

## Renaming, Adding, and Removing Columns

---

<a id='renaming-columns'></a>
### Renaming Columns

**Q.1** Rename `beer_servings` as `beer` and `wine_servings` as `wine` in the `drinks` DataFrame, returning a *new* DataFrame.

In [60]:
df2 = df.rename(columns = {'beer_servings':'beer', 'wine_servings':'wine'})
df2.head(3)

,country,beer,spirit_servings,wine,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF

**Q.2** Perform the same renaming for `drinks`, but in place.

In [62]:
df.rename(columns = {'beer_servings':'beer', 'wine_servings':'wine'}, inplace=True)

In [63]:
df.head(3)

,country,beer,spirit_servings,wine,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF

**Q.3** Replace the column names of `drinks` with `['country', 'beer', 'spirit', 'wine', 'liters', 'continent']`.

In [65]:
df.columns = ['country', 'beer', 'spirit', 'wine', 'liters', 'continent']
df.head(3)

       country  beer  spirit  wine  liters continent
0  Afghanistan     0       0     0     0.0        AS
1      Albania    89     132    54     4.9        EU
2      Algeria    25       0    14     0.7        AF

<a id='adding-columns'></a>
### Adding Columns

**Q.1** Make a `servings` column combines `beer`, `spirit`, and `wine`.

In [67]:
df['servings'] = df['beer'] + df['spirit'] + df['wine']
df.head(3)

       country  beer  spirit  wine  liters continent  servings
0  Afghanistan     0       0     0     0.0        AS         0
1      Albania    89     132    54     4.9        EU       275
2      Algeria    25       0    14     0.7        AF        39

**Q.2** Make an `mL` column that is the `liters` column multiplied by 1,000.

In [69]:
df['mL'] = df['liters']*1000
df.head(3)

       country  beer  spirit  wine  liters continent  servings      mL
0  Afghanistan     0       0     0     0.0        AS         0     0.0
1      Albania    89     132    54     4.9        EU       275  4900.0
2      Algeria    25       0    14     0.7        AF        39   700.0

<a id='removing-columns'></a>
### Removing Columns

**Q.1** Remove the `mL` column, returning a new DataFrame.

In [74]:
df3 = df.drop('mL', axis=1)
df3.head(3)

       country  beer  spirit  wine  liters continent  servings
0  Afghanistan     0       0     0     0.0        AS         0
1      Albania    89     132    54     4.9        EU       275
2      Algeria    25       0    14     0.7        AF        39

**Q.2** Remove the `mL` and `servings` columns from `drinks` in place.

In [77]:
df.drop(['mL','servings'], axis=1, inplace=True)

ValueError: labels ['mL' 'servings'] not contained in axis

In [78]:
df.head(3)

       country  beer  spirit  wine  liters continent
0  Afghanistan     0       0     0     0.0        AS
1      Albania    89     132    54     4.9        EU
2      Algeria    25       0    14     0.7        AF

<a id='missing'></a>
## Handling Missing Values

---

<a id='find-missing'></a>
### Finding Missing Values

**Q.1** Include missing values from the `continent` variable in the `drinks` DataFrame when counting unique values.

In [83]:
df['continent'].value_counts(dropna=False)

AF     53
EU     45
AS     44
NaN    23
OC     16
SA     12
Name: continent, dtype: int64

**Q.2** Create a Boolean Series indicating which values are missing or not missing in `continents`.

In [93]:
import numpy as np
df['continent'].isnull()

0      False
1      False
2      False
3      False
4      False
5       True
6      False
7      False
8      False
9      False
10     False
11      True
12     False
13     False
14      True
15     False
16     False
17      True
18     False
19     False
20     False
21     False
22     False
23     False
24     False
25     False
26     False
27     False
28     False
29     False
       ...
163    False
164    False
165    False
166    False
167    False
168    False
169    False
170    False
171    False
172    False
173    False
174     True
175    False
176    False
177    False
178    False
179    False
180    False
181    False
182    False
183    False
184     True
185    False
186    False
187    False
188    False
189    False
190    False
191    False
192    False
Name: continent, Length: 193, dtype: bool

**Q.3** Subset to rows in `drinks` where `continent` is missing and where `continent` is not missing.

In [96]:
dfm = df[df['continent'].isnull()]
dff = df[~df['continent'].isnull()]

**Q.4** Calculate the sum of `drinks`' *columns* and the sum of its *rows*.

In [ ]:
# A:

In [ ]:
# A:

**Side Note: Adding Booleans**
```python
pd.Series([True, False, True])  # Creates a Boolean Series
pd.Series([True, False, True]).sum()  # Converts `False` to 0 and `True` to 1
```

**Q.5** FInd the number of missing values by column in `drinks`.

In [ ]:
# A:

<a id='drop-missing'></a>
### Dropping Missing Values

**Q.1** Drop rows where *ANY* values are missing in `drinks` (returning a new DataFrame).  
_Make sure you know ahead of time exactly what you'll be dropping._

In [ ]:
# A:

**Q.2** Drop rows only where *ALL* values are missing in `drinks`.

In [ ]:
# A:

<a id='fill-missing'></a>
### Filling in Missing Values

What's up with these `NaN` continents?

In [ ]:
# A:

_You probably figured it out already, but all of these continents are in North America (`NA`), and, when read in, were misinterpreted as a `null` or `NaN` value._

**Q.1** Fill in the missing values of the `continent` column using string `NA`.

In [ ]:
# A:

**Q.2** Turn off the missing value filter when loading the `drinks` `.csv`.

In [ ]:
# A: